
<!DOCTYPE HTML>
<html lang="" >
    <head>
        <meta charset="UTF-8">
        <meta content="text/html; charset=utf-8" http-equiv="Content-Type">
        <title>4.C语言入门 · GitBook</title>
        <meta http-equiv="X-UA-Compatible" content="IE=edge" />
        <meta name="description" content="">
        <meta name="generator" content="GitBook 3.2.3">
        
        
        
    
    <link rel="stylesheet" href="../gitbook/style.css">

    
            
                
                <link rel="stylesheet" href="../gitbook/gitbook-plugin-highlight/website.css">
                
            
                
                <link rel="stylesheet" href="../gitbook/gitbook-plugin-search/search.css">
                
            
                
                <link rel="stylesheet" href="../gitbook/gitbook-plugin-fontsettings/website.css">
                
            
        

    

    
        
    
        
    
        
    
        
    
        
    
        
    

        
    
    
    <meta name="HandheldFriendly" content="true"/>
    <meta name="viewport" content="width=device-width, initial-scale=1, user-scalable=no">
    <meta name="apple-mobile-web-app-capable" content="yes">
    <meta name="apple-mobile-web-app-status-bar-style" content="black">
    <link rel="apple-touch-icon-precomposed" sizes="152x152" href="../gitbook/images/apple-touch-icon-precomposed-152.png">
    <link rel="shortcut icon" href="../gitbook/images/favicon.ico" type="image/x-icon">

    
    <link rel="next" href="4.html" />
    
    
    <link rel="prev" href="a.html" />
    

    </head>
    <body>
        
<div class="book">
    <div class="book-summary">
        
            
<div id="book-search-input" role="search">
    <input type="text" placeholder="Type to search" />
</div>

            
                <nav role="navigation">
                


<ul class="summary">
    
    

    

    
        
        <li class="header">目录</li>
        
        
    
        <li class="chapter " data-level="1.1" data-path="../">
            
                <a href="../">
            
                    
                    Introduction
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.2" data-path="1.html">
            
                <a href="1.html">
            
                    
                    1.C 语言介绍和发展
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.3" data-path="2.html">
            
                <a href="2.html">
            
                    
                    2.编程环境搭建
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.4" data-path="a.html">
            
                <a href="a.html">
            
                    
                    3.CPU指令的执行
            
                </a>
            

            
        </li>
    
        <li class="chapter active" data-level="1.5" data-path="3.html">
            
                <a href="3.html">
            
                    
                    4.C语言入门
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.6" data-path="4.html">
            
                <a href="4.html">
            
                    
                    5.C语言本质
            
                </a>
            

            
        </li>
    

    

    <li class="divider"></li>

    <li>
        <a href="https://www.gitbook.com" target="blank" class="gitbook-link">
            Published with GitBook
        </a>
    </li>
</ul>


                </nav>
            
        
    </div>

    <div class="book-body">
        
            <div class="body-inner">
                
                    

<div class="book-header" role="navigation">
    

    <!-- Title -->
    <h1>
        <i class="fa fa-circle-o-notch fa-spin"></i>
        <a href=".." >4.C语言入门</a>
    </h1>
</div>




                    <div class="page-wrapper" tabindex="-1" role="main">
                        <div class="page-inner">
                            
<div id="book-search-results">
    <div class="search-noresults">
    
                                <section class="normal markdown-section">
                                
                                <h3 id="c&#x8BED;&#x8A00;&#x5165;&#x95E8;">C&#x8BED;&#x8A00;&#x5165;&#x95E8;</h3>
<h4 id="&#x7B2C;-7-&#x7AE0;-&#x7ED3;&#x6784;&#x4F53;">&#x7B2C; 7 &#x7AE0; &#x7ED3;&#x6784;&#x4F53;</h4>
<ol>
<li>C&#x8BED;&#x8A00;&#x4E2D;&#x7684;&#x7ED3;&#x6784;&#x4F53;&#x7C7B;&#x4F3C;&#x53EA;&#x6709;&#x6210;&#x5458;&#x5C5E;&#x6027;&#x7684;&#x7C7B;&#x3002;</li>
<li>&#x7ED3;&#x6784;&#x4F53;&#x7684;&#x6210;&#x5458;&#x7684;&#x5B58;&#x50A8;&#x7A7A;&#x95F4;&#x662F;&#x76F8;&#x90BB;&#x7684;&#x3002;</li>
<li>&#x7ED3;&#x6784;&#x4F53;&#x7684;&#x6210;&#x5458;&#x540D;&#x548C;&#x53D8;&#x91CF;&#x540D;&#x4E0D;&#x5728;&#x540C;&#x4E00;&#x547D;&#x540D;&#x7A7A;&#x95F4;&#x4E2D;&#xFF0C;&#x4F46;&#x679A;&#x4E3E;&#x7684;&#x6210;&#x5458;&#x540D;&#x5374;&#x548C;&#x53D8;&#x91CF;&#x540D;&#x5728;&#xFF0C;&#x53C2;&#x8003;7.3&#x3002;</li>
</ol>
<h4 id="&#x7B2C;-8-&#x7AE0;-&#x6570;&#x7EC4;">&#x7B2C; 8 &#x7AE0; &#x6570;&#x7EC4;</h4>
<ol>
<li>&#x6570;&#x7EC4;&#x7C7B;&#x578B;&#x505A;&#x53F3;&#x503C;&#x4F7F;&#x7528;&#x65F6;&#xFF0C;&#x81EA;&#x52A8;&#x8F6C;&#x6362;&#x6210;&#x6307;&#x5411;&#x6570;&#x7EC4;&#x9996;&#x5143;&#x7D20;&#x7684;&#x6307;&#x9488;&#x3002;</li>
<li>&#x6570;&#x7EC4;a&#x548C;&#x6570;&#x7EC4;b&#x4E0D;&#x80FD;&#x8FD9;&#x6837;&#x5199;&#xFF1A;a=b</li>
<li>&#x4E0D;&#x80FD;&#x7528;&#x6570;&#x7EC4;&#x7C7B;&#x578B;&#x4F5C;&#x4E3A;&#x51FD;&#x6570;&#x7684;&#x53C2;&#x6570;&#x6216;&#x8FD4;&#x56DE;&#x503C;</li>
<li>&#x5728;&#x9884;&#x5904;&#x7406;&#x9636;&#x6BB5;&#xFF0C;&#x5982;&#x679C;&#x4E00;&#x884C;&#x4EE5;#&#x53F7;&#x5F00;&#x5934;&#xFF0C;&#x540E;&#x9762;&#x8DDF;include&#x6216;define&#xFF0C;&#x9884;&#x5904;&#x7406;&#x5668;&#x5C31;&#x8BA4;&#x4E3A;&#x8FD9;&#x662F;&#x4E00;&#x6761;&#x9884;&#x5904;&#x7406;&#x6307;&#x793A;&#xFF0C;&#x9664;&#x6B64;&#x4E4B;&#x5916;&#x7684;&#x4E0D;&#x662F;</li>
<li>&#x5B57;&#x7B26;&#x6570;&#x7EC4;&#xFF0C;&#x4E5F;&#x53EF;&#x4EE5;&#x7528;&#x4E00;&#x4E2A;&#x5B57;&#x7B26;&#x4E32;&#x5B57;&#x9762;&#x503C;&#x6765;&#x521D;&#x59CB;&#x5316;&#xFF1A;char str[10] = &quot;Hello&quot;&#xFF0C;&#x76F8;&#x5F53;&#x4E8E;char str[10] = { &apos;H&apos;, &apos;e&apos;, &apos;l&apos;, &apos;l&apos;, &apos;o&apos;, &apos;\0&apos; }&#x3002;&#x540E;&#x56DB;&#x4E2A;&#x5143;&#x7D20;&#x6CA1;&#x6709;&#x6307;&#x5B9A;&#xFF0C;&#x81EA;&#x52A8;&#x521D;&#x59CB;&#x5316;&#x4E3A;0&#xFF0C;&#x5373;Null&#x5B57;&#x7B26;&#x3002;</li>
<li>&#x5B57;&#x7B26;&#x6570;&#x7EC4;&#x521D;&#x59CB;&#x5316;&#x5982;&#x679C;&#x957F;&#x5EA6;&#x4E0D;&#x591F;&#xFF0C;&#x672B;&#x5C3E;&#x5C31;&#x6CA1;&#x6709;Null&#x5B57;&#x7B26;&#xFF0C;&#x90A3;&#x4E48;printf&#x51FD;&#x6570;&#x5C31;&#x4F1A;&#x8BBF;&#x95EE;&#x6570;&#x7EC4;&#x8D8A;&#x754C;&#xFF0C;&#x540E;&#x679C;&#x53EF;&#x80FD;&#x4F1A;&#x5F88;&#x8BE1;&#x5F02;</li>
<li>&#x5B57;&#x7B26;&#x6570;&#x7EC4;&#x521D;&#x59CB;&#x5316;&#x6700;&#x597D;&#x4E0D;&#x6307;&#x5B9A;&#x957F;&#x5EA6;&#xFF1A;char str[] = &quot;Hello&quot;</li>
<li>&#x591A;&#x7EF4;&#x6570;&#x7EC4;&#x9664;&#x4E86;&#x7B2C;&#x4E00;&#x7EF4;&#x7684;&#x957F;&#x5EA6;&#x53EF;&#x4EE5;&#x7531;&#x7F16;&#x8BD1;&#x5668;&#x81EA;&#x52A8;&#x8BA1;&#x7B97;&#x800C;&#x4E0D;&#x9700;&#x8981;&#x6307;&#x5B9A;&#xFF0C;&#x5176;&#x4F59;&#x5404;&#x7EF4;&#x90FD;&#x5FC5;&#x987B;&#x660E;&#x786E;&#x6307;&#x5B9A;&#x957F;&#x5EA6;&#xFF0C;&#x5982;int a[][2] = { { 1, 2 }, { 3, 4 }, { 5, } };</li>
<li>&#x8F6C;&#x6362;&#x8BF4;&#x660E;%s&#x8BFB;&#x5165;&#x4E00;&#x4E2A;&#x5B57;&#x7B26;&#x4E32;&#xFF0C;&#x5219;&#x53C2;&#x6570;&#x5E94;&#x8BE5;&#x662F;&#x6570;&#x7EC4;&#x540D;&#xFF0C;&#x6570;&#x7EC4;&#x540D;&#x524D;&#x9762;&#x4E0D;&#x52A0;&amp;&#xFF0C;&#x56E0;&#x4E3A;&#x6570;&#x7EC4;&#x7C7B;&#x578B;&#x505A;&#x53F3;&#x503C;&#x65F6;&#x81EA;&#x52A8;&#x8F6C;&#x6362;&#x6210;&#x6307;&#x9488;&#x7C7B;&#x578B;&#xFF0C;&#x5982;scanf(&quot;%s&quot;, arr);</li>
</ol>
<h4 id="&#x7B2C;-10-&#x7AE0;-gdb&#x8C03;&#x8BD5;">&#x7B2C; 10 &#x7AE0; gdb&#x8C03;&#x8BD5;</h4>
<ol>
<li>&#x4EE3;&#x7801;10.1&#x5C40;&#x90E8;&#x53D8;&#x91CF;i&#x548C;sum&#x6CA1;&#x521D;&#x59CB;&#x5316;&#xFF0C;&#x6240;&#x4EE5;&#x5177;&#x6709;&#x4E0D;&#x786E;&#x5B9A;&#x7684;&#x503C;&#xFF0C;&#x53C8;&#x7531;&#x4E8E;&#x4E24;&#x6B21;&#x8C03;&#x7528;&#x662F;&#x6328;&#x7740;&#x7684;&#xFF0C;i&#x548C;sum&#x6B63;&#x597D;&#x53D6;&#x4E86;&#x4E0A;&#x6B21;&#x8C03;&#x7528;&#x65F6;&#x7684;&#x503C;</li>
<li>&#x9519;&#x8BEF;&#x4FE1;&#x53F7;SIGSEGV&#xFF0C;&#x6BB5;&#x9519;&#x8BEF;Segmentation fault</li>
<li>&#x5982;&#x679C;&#x67D0;&#x4E2A;&#x51FD;&#x6570;&#x7684;&#x5C40;&#x90E8;&#x53D8;&#x91CF;&#x53D1;&#x751F;&#x8BBF;&#x95EE;&#x8D8A;&#x754C;&#xFF0C;&#x6709;&#x53EF;&#x80FD;&#x5E76;&#x4E0D;&#x7ACB;&#x5373;&#x4EA7;&#x751F;&#x6BB5;&#x9519;&#x8BEF;&#xFF0C;&#x800C;&#x662F;&#x5728;&#x51FD;&#x6570;&#x8FD4;&#x56DE;&#x65F6;&#x4EA7;&#x751F;&#x6BB5;&#x9519;&#x8BEF;&#x3002;</li>
</ol>
<h4 id="&#x7B2C;-11-&#x7AE0;-&#x6392;&#x5E8F;&#x4E0E;&#x67E5;&#x627E;">&#x7B2C; 11 &#x7AE0; &#x6392;&#x5E8F;&#x4E0E;&#x67E5;&#x627E;</h4>
<ol>
<li>&#x5728;&#x4EE3;&#x7801;&#x4E2D;&#x9002;&#x5F53;&#x7684;&#x5730;&#x65B9;&#x4F7F;&#x7528;&#x65AD;&#x8A00;&#xFF08;Assertion&#xFF09;&#x53EF;&#x4EE5;&#x6709;&#x6548;&#x5730;&#x5E2E;&#x52A9;&#x6211;&#x4EEC;&#x6D4B;&#x8BD5;&#x7A0B;&#x5E8F;&#x3002;</li>
<li>&#x4F7F;&#x7528;&#x65AD;&#x8A00;&#xFF1A;#include <assert.h>&#xFF0C;assert(bool)</assert.h></li>
<li>&#x7981;&#x7528;assert.h&#x4E2D;&#x7684;assert&#x5B8F;&#x5B9A;&#x4E49;&#x7684;&#x4E24;&#x4E2A;&#x65B9;&#x6CD5;&#xFF1A;<ol>
<li>#define NDEBUG</li>
<li>&#x7F16;&#x8BD1;&#x547D;&#x4EE4;&#x884C;&#x52A0;&#x4E0A;&#x9009;&#x9879;-DNDEBUG</li>
</ol>
</li>
</ol>
<h4 id="&#x7B2C;-12-&#x7AE0;-&#x6808;&#x4E0E;&#x961F;&#x5217;">&#x7B2C; 12 &#x7AE0; &#x6808;&#x4E0E;&#x961F;&#x5217;</h4>
<ol>
<li>&#x6570;&#x636E;&#x7684;&#x7EC4;&#x7EC7;&#x65B9;&#x5F0F;&#x5305;&#x542B;&#x4E86;&#x5B58;&#x50A8;&#x65B9;&#x5F0F;&#x548C;&#x8BBF;&#x95EE;&#x65B9;&#x5F0F;&#x8FD9;&#x4E24;&#x5C42;&#x610F;&#x601D;&#xFF0C;&#x4E8C;&#x8005;&#x662F;&#x7D27;&#x5BC6;&#x8054;&#x7CFB;&#x7684;&#x3002;</li>
<li>&#x6570;&#x7EC4;&#xFF1A;&#x5404;&#x5143;&#x7D20;&#x662F;&#x4E00;&#x4E2A;&#x6328;&#x4E00;&#x4E2A;&#x5B58;&#x50A8;&#x7684;&#xFF0C;&#x5E76;&#x4E14;&#x6BCF;&#x4E2A;&#x5143;&#x7D20;&#x7684;&#x5927;&#x5C0F;&#x76F8;&#x540C;&#xFF0C;&#x56E0;&#x6B64;&#x6570;&#x7EC4;&#x53EF;&#x4EE5;&#x63D0;&#x4F9B;&#x6309;&#x4E0B;&#x6807;&#x8BBF;&#x95EE;&#x7684;&#x65B9;&#x5F0F;</li>
<li>&#x7ED3;&#x6784;&#x4F53;&#xFF1A;&#x5404;&#x6210;&#x5458;&#x4E5F;&#x662F;&#x4E00;&#x4E2A;&#x6328;&#x4E00;&#x4E2A;&#x5B58;&#x50A8;&#x7684;&#xFF0C;&#x4F46;&#x662F;&#x6BCF;&#x4E2A;&#x6210;&#x5458;&#x7684;&#x5927;&#x5C0F;&#x4E0D;&#x540C;&#xFF0C;&#x6240;&#x4EE5;&#x53EA;&#x80FD;&#x7528;.&#x8FD0;&#x7B97;&#x7B26;&#x52A0;&#x6210;&#x5458;&#x540D;&#x6765;&#x8BBF;&#x95EE;&#xFF0C;&#x800C;&#x4E0D;&#x80FD;&#x6309;&#x4E0B;&#x6807;&#x8BBF;&#x95EE;</li>
<li>putchar()&#x8F93;&#x51FA;&#x4E00;&#x4E2A;&#x5B57;&#x7B26;&#x5230;&#x6807;&#x51C6;&#x8F93;&#x51FA;stdout&#x4E2D;</li>
<li>getchar()&#x8BFB;&#x53D6;&#x7528;&#x6237;&#x4ECE;&#x952E;&#x76D8;&#x8F93;&#x5165;&#x7684;&#x5355;&#x4E2A;&#x5B57;&#x7B26;</li>
</ol>
<h4 id="c&#x7684;&#x8BED;&#x6CD5;&#x89C4;&#x5219;">C&#x7684;&#x8BED;&#x6CD5;&#x89C4;&#x5219;</h4>
<ol>
<li><a href="https://blog.csdn.net/qq_41403559/article/details/104313744" target="_blank">C&#x8BED;&#x8A00;&#x5165;&#x95E8;&#x603B;&#x7ED3;&#x2014;&#x2014;Linux C&#x7F16;&#x7A0B;&#x4E00;&#x7AD9;&#x5F0F;&#x5B66;&#x4E60;</a></li>
<li>&#x6E90;&#x6587;&#x4EF6;&#x4E2D;&#x6240;&#x6709;&#x51FD;&#x6570;&#x5B9A;&#x4E49;&#x4E4B;&#x5916;&#x53EF;&#x4EE5;&#x51FA;&#x73B0;&#x54EA;&#x4E9B;&#x8BED;&#x6CD5;&#x5143;&#x7D20;&#xFF1F;<ul>
<li>&#x5168;&#x5C40;&#x53D8;&#x91CF;</li>
<li>&#x51FD;&#x6570;&#x58F0;&#x660E;&#xFF1A;&#x51FD;&#x6570;&#x58F0;&#x660E;&#x7684;&#x683C;&#x5F0F;&#x975E;&#x5E38;&#x7B80;&#x5355;&#xFF0C;&#x76F8;&#x5F53;&#x4E8E;&#x53BB;&#x6389;&#x51FD;&#x6570;&#x5B9A;&#x4E49;&#x4E2D;&#x7684;&#x51FD;&#x6570;&#x4F53;&#xFF0C;&#x5E76;&#x5728;&#x6700;&#x540E;&#x52A0;&#x4E0A;&#x5206;&#x53F7;&#xFF08;&#x6709;&#x70B9;&#x7C7B;&#x4F3C;&#x9762;&#x5411;&#x5BF9;&#x8C61;&#x4E2D;&#x63A5;&#x53E3;&#x7C7B;&#x7684;&#x65B9;&#x6CD5;&#x5B9A;&#x4E49;&#xFF09;</li>
<li>&#x51FD;&#x6570;&#x539F;&#x578B;&#xFF1A;&#x51FD;&#x6570;&#x58F0;&#x660E;&#x7ED9;&#x51FA;&#x4E86;&#x51FD;&#x6570;&#x540D;&#x3001;&#x8FD4;&#x56DE;&#x503C;&#x7C7B;&#x578B;&#x3001;&#x53C2;&#x6570;&#x5217;&#x8868;&#xFF08;&#x91CD;&#x70B9;&#x662F;&#x53C2;&#x6570;&#x7C7B;&#x578B;&#xFF09;&#x7B49;&#x4E0E;&#x8BE5;&#x51FD;&#x6570;&#x6709;&#x5173;&#x7684;&#x4FE1;&#x606F;&#xFF0C;&#x79F0;&#x4E3A;&#x51FD;&#x6570;&#x539F;&#x578B;</li>
<li>&#x5B8F;&#x5B9A;&#x4E49;(#define)</li>
<li>&#x7C7B;&#x578B;&#x5B9A;&#x4E49;(typedef)</li>
<li>&#x7ED3;&#x6784;&#x4F53;(struct)</li>
<li>&#x8054;&#x5408;&#x4F53;(union)&#xFF1A;&#x6210;&#x5458;&#x5B58;&#x653E;&#x5728;&#x540C;&#x4E00;&#x5757;&#x5185;&#x5B58;&#x5355;&#x5143;&#x4E2D;&#xFF0C;&#x5373;&#x5171;&#x7528;&#x540C;&#x4E00;&#x5757;&#x5185;&#x5B58;&#x5355;&#x5143;&#x3002;&#x56E0;&#x6B64;&#x8054;&#x5408;&#x4F53;&#x4E5F;&#x79F0;&#x4E3A;&#x5171;&#x7528;&#x4F53;</li>
<li>&#x6CE8;&#x91CA;</li>
</ul>
</li>
<li>&#x51FD;&#x6570;&#x5B9A;&#x4E49;&#x4E4B;&#x4E2D;&#x53EF;&#x4EE5;&#x51FA;&#x73B0;&#x54EA;&#x4E9B;&#x8BED;&#x6CD5;&#x5143;&#x7D20;&#xFF1F;<ul>
<li>&#x5C40;&#x90E8;&#x53D8;&#x91CF;&#x5B9A;&#x4E49;&#xFF0C;&#x8BED;&#x53E5;&#x5757;&#xFF0C;&#x6CE8;&#x91CA;</li>
</ul>
</li>
<li>&#x8BED;&#x53E5;&#x6709;&#x54EA;&#x51E0;&#x79CD;&#xFF1F;<ul>
<li>&#x8868;&#x8FBE;&#x5F0F;&#x8BED;&#x53E5;&#x3001;&#x51FD;&#x6570;&#x8C03;&#x7528;&#x8BED;&#x53E5;&#x3001;&#x63A7;&#x5236;&#x8BED;&#x53E5;&#x3001;&#x590D;&#x5408;&#x8BED;&#x53E5;&#x3001;&#x7A7A;&#x8BED;&#x53E5;</li>
</ul>
</li>
<li>&#x54EA;&#x4E9B;&#x8BED;&#x6CD5;&#x5143;&#x7D20;&#x9700;&#x8981;&#x9075;&#x5FAA;&#x6807;&#x8BC6;&#x7B26;&#x7684;&#x547D;&#x540D;&#x89C4;&#x5219;&#xFF1F;<ul>
<li>&#x6807;&#x8BC6;&#x7B26;&#x7684;&#x547D;&#x540D;&#x89C4;&#x5219;&#x5373;&#xFF1A;&#x5FC5;&#x987B;&#x7528;&#x5B57;&#x6BCD;/&#x4E0B;&#x5212;&#x7EBF;&#x5F00;&#x5934;&#xFF1B;&#x53EA;&#x6709;&#x4E0B;&#x5212;&#x7EBF;&#x3001;&#x5B57;&#x6BCD;&#x3001;&#x6570;&#x5B57;&#x7684;&#x7EC4;&#x5408;&#xFF1B;&#x4E0D;&#x80FD;&#x662F;&#x5173;&#x952E;&#x5B57;</li>
<li>&#x8BED;&#x6CD5;&#x5143;&#x7D20;&#x6709;&#xFF1A;&#x51FD;&#x6570;&#x540D;&#x3001;&#x53D8;&#x91CF;&#x540D;&#x3001;&#x7C7B;&#x578B;&#x540D;</li>
</ul>
</li>
<li>&#x8868;&#x8FBE;&#x5F0F;&#x7531;&#x54EA;&#x4E9B;&#x8BED;&#x6CD5;&#x5143;&#x7D20;&#x7EC4;&#x6210;&#xFF1F;<ul>
<li>&#x7531;&#x64CD;&#x4F5C;&#x6570;&#x548C;&#x8FD0;&#x7B97;&#x7B26;&#x6309;&#x7167;&#x4E00;&#x5B9A;&#x7684;&#x8BED;&#x6CD5;&#x89C4;&#x5219;&#x7EC4;&#x6210;</li>
</ul>
</li>
<li>&#x5230;&#x76EE;&#x524D;&#x4E3A;&#x6B62;&#x5B66;&#x8FC7;&#x54EA;&#x4E9B;&#x8FD0;&#x7B97;&#x7B26;&#xFF1F;&#x5B83;&#x4EEC;&#x7684;&#x4F18;&#x5148;&#x7EA7;&#x548C;&#x7ED3;&#x5408;&#x6027;&#x662F;&#x600E;&#x6837;&#x7684;&#xFF1F;<ul>
<li>&#x7B97;&#x672F;&#x8FD0;&#x7B97;&#x7B26;&#xFF1A;&#x7528;&#x4E8E;&#x5404;&#x7C7B;&#x6570;&#x503C;&#x8FD0;&#x7B97;&#x3002;&#x5305;&#x62EC;&#x52A0;(+)&#x3001;&#x51CF;(-)&#x3001;&#x4E58;(*)&#x3001;&#x9664;(/)&#x3001;&#x6C42;&#x4F59;(%)&#x3001;&#x81EA;&#x589E;(++)&#x3001;&#x81EA;&#x51CF;(&#x2013;)&#x5171;&#x4E03;&#x79CD;&#x3002;</li>
<li>&#x8D4B;&#x503C;&#x8FD0;&#x7B97;&#x7B26;&#xFF1A;&#x7528;&#x4E8E;&#x8D4B;&#x503C;&#x8FD0;&#x7B97;&#xFF0C;&#x5206;&#x4E3A;&#x7B80;&#x5355;&#x8D4B;&#x503C;(=)&#x3001;&#x590D;&#x5408;&#x7B97;&#x672F;&#x8D4B;&#x503C;(+=,-=,*=,/=,%=)&#x548C;&#x590D;&#x5408;&#x4F4D;&#x8FD0;&#x7B97;&#x8D4B;&#x503C;(&amp;=,|=,^=,&gt;&gt;=,&lt;&lt;=)&#x4E09;&#x7C7B;&#x5171;&#x5341;&#x4E00;&#x79CD;&#x3002;</li>
<li>&#x9017;&#x53F7;&#x8FD0;&#x7B97;&#x7B26;&#xFF1A;&#x7528;&#x4E8E;&#x628A;&#x82E5;&#x5E72;&#x8868;&#x8FBE;&#x5F0F;&#x7EC4;&#x5408;&#x6210;&#x4E00;&#x4E2A;&#x8868;&#x8FBE;&#x5F0F;(,)&#x3002;</li>
<li>&#x5173;&#x7CFB;&#x8FD0;&#x7B97;&#x7B26;&#xFF1A;&#x7528;&#x4E8E;&#x6BD4;&#x8F83;&#x8FD0;&#x7B97;&#x3002;&#x5305;&#x62EC;&#x5927;&#x4E8E;(&gt;)&#x3001;&#x5C0F;&#x4E8E;(&lt;)&#x3001;&#x7B49;&#x4E8E;(==)&#x3001; &#x5927;&#x4E8E;&#x7B49;&#x4E8E;(&gt;=)&#x3001;&#x5C0F;&#x4E8E;&#x7B49;&#x4E8E;(&lt;=)&#x548C;&#x4E0D;&#x7B49;&#x4E8E;(!=)&#x516D;&#x79CD;&#x3002;</li>
<li>&#x903B;&#x8F91;&#x8FD0;&#x7B97;&#x7B26;&#xFF1A;&#x7528;&#x4E8E;&#x903B;&#x8F91;&#x8FD0;&#x7B97;&#x3002;&#x5305;&#x62EC;&#x4E0E;(&amp;&amp;)&#x3001;&#x6216;(||)&#x3001;&#x975E;(!)&#x4E09;&#x79CD;&#x3002;</li>
<li>&#x6761;&#x4EF6;&#x8FD0;&#x7B97;&#x7B26;&#xFF1A;&#x8FD9;&#x662F;&#x4E00;&#x4E2A;&#x4E09;&#x76EE;&#x8FD0;&#x7B97;&#x7B26;&#xFF0C;&#x7528;&#x4E8E;&#x6761;&#x4EF6;&#x6C42;&#x503C;(?:)&#x3002;</li>
<li>&#x4F4D;&#x64CD;&#x4F5C;&#x8FD0;&#x7B97;&#x7B26;&#xFF1A;&#x53C2;&#x4E0E;&#x8FD0;&#x7B97;&#x7684;&#x91CF;&#xFF0C;&#x6309;&#x4E8C;&#x8FDB;&#x5236;&#x4F4D;&#x8FDB;&#x884C;&#x8FD0;&#x7B97;&#x3002;&#x5305;&#x62EC;&#x4F4D;&#x4E0E;(&amp;)&#x3001;&#x4F4D;&#x6216;(|)&#x3001;&#x4F4D;&#x975E;(~)&#x3001;&#x4F4D;&#x5F02;&#x6216;(^)&#x3001;&#x5DE6;&#x79FB;(&lt;&lt;)&#x3001;&#x53F3;&#x79FB;(&gt;&gt;)&#x516D;&#x79CD;&#x3002;</li>
<li>&#x6307;&#x9488;&#x8FD0;&#x7B97;&#x7B26;&#xFF1A;&#x7528;&#x4E8E;&#x53D6;&#x5185;&#x5BB9;(*)&#x548C;&#x53D6;&#x5730;&#x5740;(&amp;)&#x4E8C;&#x79CD;&#x8FD0;&#x7B97;&#x3002;</li>
<li>&#x6C42;&#x5B57;&#x8282;&#x6570;&#x8FD0;&#x7B97;&#x7B26;&#xFF1A;&#x7528;&#x4E8E;&#x8BA1;&#x7B97;&#x6570;&#x636E;&#x7C7B;&#x578B;&#x6240;&#x5360;&#x7684;&#x5B57;&#x8282;&#x6570;(sizeof)&#x3002;</li>
<li>&#x7279;&#x6B8A;&#x8FD0;&#x7B97;&#x7B26;&#xFF1A;&#x6709;&#x62EC;&#x53F7;()&#xFF0C;&#x4E0B;&#x6807;[]&#xFF0C;&#x6210;&#x5458;(&#x2192;&#xFF0C;.)&#x7B49;&#x51E0;&#x79CD;&#x3002;</li>
</ul>
</li>
<li>&#x54EA;&#x4E9B;&#x8FD0;&#x7B97;&#x7B26;&#x53D6;&#x64CD;&#x4F5C;&#x6570;&#x7684;&#x5DE6;&#x503C;&#xFF1F;&#x54EA;&#x4E9B;&#x8FD0;&#x7B97;&#x7B26;&#x7684;&#x64CD;&#x4F5C;&#x6570;&#x5FC5;&#x987B;&#x662F;&#x6574;&#x578B;&#xFF1F;&#x54EA;&#x4E9B;&#x8FD0;&#x7B97;&#x7B26;&#x6709;&#x526F;&#x4F5C;&#x7528;(Side Effect)&#xFF1F;<ul>
<li>&#x53D6;&#x5730;&#x5740;&#x8FD0;&#x7B97;&#x7B26;&#x3001;++&#x8FD0;&#x7B97;&#x7B26;&#x3001;&#x2013;&#x8FD0;&#x7B97;&#x7B26;&#x3001;&#x8D4B;&#x503C;&#x8FD0;&#x7B97;&#x7B26;&#x7684;&#x5DE6;&#x4FA7;&#x3001;&#x6210;&#x5458;&#x8FD0;&#x7B97;&#x7B26;&#x7684;&#x5DE6;&#x4FA7;&#x53D6;&#x64CD;&#x4F5C;&#x6570;&#x8981;&#x6C42;&#x662F;&#x5DE6;&#x503C;&#x3002;</li>
<li>&#x53D6;&#x6A21;&#x8FD0;&#x7B97;&#x7B26;&#xFF08;%&#xFF09;&#x7684;&#x64CD;&#x4F5C;&#x6570;&#x5FC5;&#x987B;&#x662F;&#x6574;&#x578B;&#xFF1B;</li>
<li>&#x5F53;&#x8FD0;&#x7B97;&#x7B26;&#x6539;&#x53D8;&#x4E86;&#x64CD;&#x4F5C;&#x6570;&#x65F6;&#x5C31;&#x53EF;&#x80FD;&#x6709;&#x526F;&#x4F5C;&#x7528;&#xFF0C;&#x5982;&#x524D;&#x81EA;&#x589E;&#x3001;&#x8D4B;&#x503C;&#x3002;</li>
</ul>
</li>
<li>&#x54EA;&#x4E9B;&#x8868;&#x8FBE;&#x5F0F;&#x53EF;&#x4EE5;&#x505A;&#x5DE6;&#x503C;&#xFF1F;&#x54EA;&#x4E9B;&#x8868;&#x8FBE;&#x5F0F;&#x53EA;&#x80FD;&#x505A;&#x53F3;&#x503C;&#xFF1F;<ul>
<li>&#x51FD;&#x6570;&#x8C03;&#x7528;&#x8868;&#x8FBE;&#x5F0F;&#x548C;&#x5F3A;&#x5236;&#x8F6C;&#x6362;&#x8868;&#x8FBE;&#x5F0F;&#x7684;&#x7ED3;&#x679C;&#xFF0C;&#x5728;C&#x4E2D;&#x90FD;&#x5C5E;&#x4E8E;&#x53F3;&#x503C;</li>
<li>&#x7ED3;&#x679C;&#x4E3A;&#x5F15;&#x7528;&#x7684;&#x51FD;&#x6570;&#x8C03;&#x7528;&#x8868;&#x8FBE;&#x5F0F;&#x548C;&#x5F3A;&#x5236;&#x8F6C;&#x6362;&#x8868;&#x8FBE;&#x5F0F;&#x90FD;&#x5C5E;&#x4E8E;&#x5DE6;&#x503C;&#x3002;</li>
</ul>
</li>
<li>&#x54EA;&#x4E9B;&#x5730;&#x65B9;&#x5FC5;&#x987B;&#x7528;&#x5E38;&#x91CF;&#x8868;&#x8FBE;&#x5F0F;&#xFF1F;&#x54EA;&#x4E9B;&#x5730;&#x65B9;&#x5FC5;&#x987B;&#x7528;&#x6574;&#x6570;&#x5E38;&#x91CF;&#x8868;&#x8FBE;&#x5F0F;&#xFF1F;</li>
</ol>
<h4 id="&#x601D;&#x7EF4;&#x65B9;&#x6CD5;&#x4E0E;&#x7F16;&#x7A0B;&#x601D;&#x60F3;">&#x601D;&#x7EF4;&#x65B9;&#x6CD5;&#x4E0E;&#x7F16;&#x7A0B;&#x601D;&#x60F3;</h4>
<ul>
<li>&#x4EE5;&#x6982;&#x5FF5;&#x4E3A;&#x4E2D;&#x5FC3;&#xFF1A;&#x6BCF;&#x5B66;&#x4E60;&#x4E00;&#x7AE0;&#x8981;&#x8BB0;&#x4F4F;&#x8FD9;&#x4E00;&#x7AE0;&#x7684;&#x6982;&#x5FF5;</li>
<li>&#x7EC4;&#x5408;&#x89C4;&#x5219;&#xFF1A;&#x590D;&#x6742;&#x8868;&#x8FBE;&#x5F0F;&#x7531;&#x5B50;&#x8868;&#x8FBE;&#x5F0F;&#x7EC4;&#x6210;</li>
<li>&#x4E00;&#x4E2A;&#x5BB9;&#x6613;&#x88AB;&#x7528;&#x6237;&#x63A5;&#x53D7;&#x7684;&#x8BBE;&#x8BA1;&#x5E94;&#x8BE5;&#x9075;&#x5FAA;&#x6700;&#x5C11;&#x4F8B;&#x5916;&#x539F;&#x5219;&#xFF08;Rule of Least Surprise&#xFF09;&#xFF1A;&#x51CF;&#x5C11;&#x5FC3;&#x667A;&#x8D1F;&#x62C5;</li>
<li>&#x4E0D;&#x8981;&#x628A;&#x5FC5;&#x8981;&#x6761;&#x4EF6;&#xFF08;Necessary Condition&#xFF09;&#x5F53;&#x5145;&#x5206;&#x6761;&#x4EF6;&#xFF08;Sufficient Condition&#xFF09;</li>
<li>&#x5C01;&#x88C5;&#xFF08;Encapsulate&#xFF09;</li>
<li>&#x5E03;&#x5C14;&#x7C7B;&#x578B;&#xFF08;Boolean&#xFF09;&#xFF1A;&#x975E;0&#x8868;&#x793A;&#x771F;&#xFF0C;0&#x8868;&#x793A;&#x5047;</li>
<li>&#x9012;&#x5F52;&#xFF08;Recursive&#xFF09;</li>
<li>&#x51FD;&#x6570;&#x5F0F;&#x7F16;&#x7A0B;&#xFF08;Functional Programming&#xFF09;</li>
<li>&#x6570;&#x636E;&#x62BD;&#x8C61;&#xFF1A;&#x63D0;&#x53D6;&#x516C;&#x56E0;&#x5F0F;</li>
<li>&#x6570;&#x636E;&#x9A71;&#x52A8;&#x7684;&#x7F16;&#x7A0B;&#xFF08;Data-driven Programming&#xFF09;&#xFF1A;&#x7528;&#x6570;&#x636E;&#x4EE3;&#x66FF;&#x4EE3;&#x7801;&#x903B;&#x8F91;&#x5757;&#xFF0C;&#x4EE3;&#x7801;&#x66F4;&#x7B80;&#x6D01;</li>
</ul>
<h4 id="&#x8C03;&#x8BD5;&#x65B9;&#x6CD5;">&#x8C03;&#x8BD5;&#x65B9;&#x6CD5;</h4>
<ul>
<li>&#x7F16;&#x8BD1;&#x9519;&#x8BEF;&#x3001;&#x8FD0;&#x884C;&#x65F6;&#x9519;&#x8BEF;&#x4E0E;&#x8BED;&#x4E49;&#x9519;&#x8BEF;</li>
<li>&#x589E;&#x91CF;&#x5F0F;&#xFF08;Incremental&#xFF09;&#x5F00;&#x53D1;&#xFF1A;&#x5148;&#x4FDD;&#x8BC1;&#x90E8;&#x5206;&#x4EE3;&#x7801;&#x8FD0;&#x884C;&#x63D0;&#x4F9B;&#xFF0C;&#x518D;&#x5199;&#x5B8C;&#x6574;&#x4EE3;&#x7801;</li>
<li>&#x6253;&#x5370;&#x8BED;&#x53E5;&#x4E0E;&#x811A;&#x624B;&#x67B6;&#xFF08;Scaffold&#xFF09;&#xFF1A;&#x597D;&#x6BD4;&#x76D6;&#x623F;&#x5B50;&#x7684;&#x65F6;&#x5019;&#x6DFB;&#x7816;&#x3001;&#x52A0;&#x76D6;&#x3001;&#x5237;&#x6F06;&#xFF0C;&#x9700;&#x8981;&#x7528;&#x5230;&#x811A;&#x624B;&#x67B6;</li>
<li>gdb</li>
<li>Design by Contract&#xFF08;DbC&#xFF09;<ol>
<li>&#x51FD;&#x6570;&#x7684;&#x8C03;&#x7528;&#x8005;&#xFF08;Caller&#xFF09;&#x548C;&#x51FD;&#x6570;&#x7684;&#x5B9E;&#x73B0;&#x8005;&#xFF08;Callee&#xFF0C;&#x88AB;&#x8C03;&#x7528;&#x8005;&#xFF09;&#x4E4B;&#x95F4;&#x8BA2;&#x7ACB;&#x4E86;&#x4E00;&#x4E2A;&#x5951;&#x7EA6;&#xFF08;Contract&#xFF09;</li>
<li>&#x5728;&#x8C03;&#x7528;&#x51FD;&#x6570;&#x4E4B;&#x524D;&#xFF0C;Caller&#x8981;&#x4E3A;Callee&#x63D0;&#x4F9B;&#x67D0;&#x4E9B;&#x6761;&#x4EF6;&#xFF0C;&#x6BD4;&#x5982;&#x786E;&#x4FDD;&#x6570;&#x7EC4;&#x662F;&#x6392;&#x597D;&#x5E8F;&#x7684;&#xFF0C;&#x8FD9;&#x79F0;&#x4E3A;Precondition</li>
<li>Callee&#x5BF9;&#x4E00;&#x4E9B;Invariant&#x8FDB;&#x884C;&#x7EF4;&#x62A4;&#xFF08;Maintenance&#xFF09;&#xFF0C;&#x8FD9;&#x4E9B;Invariant&#x4FDD;&#x8BC1;&#x4E86;Callee&#x5728;&#x51FD;&#x6570;&#x8FD4;&#x56DE;&#x65F6;&#x80FD;&#x591F;&#x5BF9;Caller&#x5C3D;&#x5230;&#x67D0;&#x4E9B;&#x4E49;&#x52A1;&#xFF0C;&#x8FD9;&#x79F0;&#x4E3A;Postcondition&#x3002;</li>
<li>&#x5982;&#x679C;&#x6BCF;&#x4E2A;&#x51FD;&#x6570;&#x7684;&#x6587;&#x6863;&#x90FD;&#x975E;&#x5E38;&#x6E05;&#x695A;&#x5730;&#x8BB0;&#x5F55;&#x4E86;Precondition&#x3001;Maintenance&#x548C;Postcondition&#x662F;&#x4EC0;&#x4E48;&#xFF0C;&#x90A3;&#x4E48;&#x6BCF;&#x4E2A;&#x51FD;&#x6570;&#x90FD;&#x53EF;&#x4EE5;&#x72EC;&#x7ACB;&#x7F16;&#x5199;&#x548C;&#x6D4B;&#x8BD5;&#xFF0C;&#x6574;&#x4E2A;&#x7CFB;&#x7EDF;&#x5C31;&#x4F1A;&#x6613;&#x4E8E;&#x7EF4;&#x62A4;&#x3002;</li>
<li>&#x8FD9;&#x79CD;&#x7F16;&#x7A0B;&#x601D;&#x60F3;&#x88AB;&#x79F0;&#x4E3A;Design by Contract&#xFF08;DbC&#xFF09;</li>
</ol>
</li>
<li>Assertion</li>
</ul>

                                
                                </section>
                            
    </div>
    <div class="search-results">
        <div class="has-results">
            
            <h1 class="search-results-title"><span class='search-results-count'></span> results matching "<span class='search-query'></span>"</h1>
            <ul class="search-results-list"></ul>
            
        </div>
        <div class="no-results">
            
            <h1 class="search-results-title">No results matching "<span class='search-query'></span>"</h1>
            
        </div>
    </div>
</div>

                        </div>
                    </div>
                
            </div>

            
                
                <a href="a.html" class="navigation navigation-prev " aria-label="Previous page: 3.CPU指令的执行">
                    <i class="fa fa-angle-left"></i>
                </a>
                
                
                <a href="4.html" class="navigation navigation-next " aria-label="Next page: 5.C语言本质">
                    <i class="fa fa-angle-right"></i>
                </a>
                
            
        
    </div>

    <script>
        var gitbook = gitbook || [];
        gitbook.push(function() {
            gitbook.page.hasChanged({"page":{"title":"4.C语言入门","level":"1.5","depth":1,"next":{"title":"5.C语言本质","level":"1.6","depth":1,"path":"docs/4.md","ref":"docs/4.md","articles":[]},"previous":{"title":"3.CPU指令的执行","level":"1.4","depth":1,"path":"docs/a.md","ref":"docs/a.md","articles":[]},"dir":"ltr"},"config":{"gitbook":"*","theme":"default","variables":{},"plugins":[],"pluginsConfig":{"highlight":{},"search":{},"lunr":{"maxIndexSize":1000000,"ignoreSpecialCharacters":false},"sharing":{"facebook":true,"twitter":true,"google":false,"weibo":false,"instapaper":false,"vk":false,"all":["facebook","google","twitter","weibo","instapaper"]},"fontsettings":{"theme":"white","family":"sans","size":2},"theme-default":{"styles":{"website":"styles/website.css","pdf":"styles/pdf.css","epub":"styles/epub.css","mobi":"styles/mobi.css","ebook":"styles/ebook.css","print":"styles/print.css"},"showLevel":false}},"structure":{"langs":"LANGS.md","readme":"README.md","glossary":"GLOSSARY.md","summary":"SUMMARY.md"},"pdf":{"pageNumbers":true,"fontSize":12,"fontFamily":"Arial","paperSize":"a4","chapterMark":"pagebreak","pageBreaksBefore":"/","margin":{"right":62,"left":62,"top":56,"bottom":56}},"styles":{"website":"styles/website.css","pdf":"styles/pdf.css","epub":"styles/epub.css","mobi":"styles/mobi.css","ebook":"styles/ebook.css","print":"styles/print.css"}},"file":{"path":"docs/3.md","mtime":"2020-10-26T02:22:06.777Z","type":"markdown"},"gitbook":{"version":"3.2.3","time":"2020-10-26T02:22:31.308Z"},"basePath":"..","book":{"language":""}});
        });
    </script>
</div>

        
    <script src="../gitbook/gitbook.js"></script>
    <script src="../gitbook/theme.js"></script>
    
        
        <script src="../gitbook/gitbook-plugin-search/search-engine.js"></script>
        
    
        
        <script src="../gitbook/gitbook-plugin-search/search.js"></script>
        
    
        
        <script src="../gitbook/gitbook-plugin-lunr/lunr.min.js"></script>
        
    
        
        <script src="../gitbook/gitbook-plugin-lunr/search-lunr.js"></script>
        
    
        
        <script src="../gitbook/gitbook-plugin-sharing/buttons.js"></script>
        
    
        
        <script src="../gitbook/gitbook-plugin-fontsettings/fontsettings.js"></script>
        
    

    </body>
</html>

